ukw100/STECCY/src/sdcard/stm32_sdcard.c
//--------------------------------------------------------------
// 1bit-Mode :
//
//   PC8  -> SDIO_D0  = SD-Karte DAT0
//   PC12 -> SDIO_CK  = SD-Karte Clock
//   PD2  -> SDIO_CMD = SD-Karte CMD
//
// 4bit-Mode :
//
//   PC8  -> SDIO_D0  = SD-Karte DAT0
//   PC9  -> SDIO_D1  = SD-Karte DAT1
//   PC10 -> SDIO_D2  = SD-Karte DAT2
//   PC11 -> SDIO_D3  = SD-Karte DAT3/CD
//   PC12 -> SDIO_CK  = SD-Karte Clock
//   PD2  -> SDIO_CMD = SD-Karte CMD
//
// mit Detect-Pin :
//
//   PC0  -> SD_Detect-Pin (Hi=ohne SD-Karte)
//
//              DMA : entweder DMA2_STREAM3_CHANNEL4
//                    oder     DMA2_STREAM6_CHANNEL4
//--------------------------------------------------------------
// Warning  : The STM32F4 in Revision-A generates a
//            "SDIO_IT_DCRCFAIL" in function "SD_ProcessIRQSrc"
//            To avoid this set the Define "SDIO_STM32F4_REV" to 0
//            (check the STM-Errata-Sheet for more information)
//            [Thanks to Major for posting this BUG...UB]
//--------------------------------------------------------------

#include "stm32_sdcard.h"
#include <stdio.h>
#include "delay.h"

#ifdef __GNUC__
#  define UNUSED(x)         UNUSED_ ## x __attribute__((__unused__))
#else
#  define UNUSED(x)         UNUSED_ ## x
#endif

static uint32_t                 CardType =  SDIO_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t                 CSD_Tab[4], CID_Tab[4], RCA = 0;
//000 static uint8_t            SDSTATUS_Tab[16];
static volatile uint32_t        StopCondition = 0;
static volatile SD_Error        TransferError = SD_OK;
static volatile uint32_t        TransferEnd = 0, DMAEndOfTransfer = 0;
static SD_CardInfo              SDCardInfo;

static SDIO_InitTypeDef         SDIO_InitStructure;
static SDIO_CmdInitTypeDef      SDIO_CmdInitStructure;
static SDIO_DataInitTypeDef     SDIO_DataInitStructure;

static void                     NVIC_Configuration(void);
//000 static void               SD_DeInit(void);
static SD_Error                 SD_Init(void);
static SDTransferState          SD_GetStatus(void);
static SDCardState              SD_GetState(void);
static uint8_t                  SD_Detect(void);
static SD_Error                 SD_PowerON(void);
//000 static SD_Error           SD_PowerOFF(void);
static SD_Error                 SD_InitializeCards(void);
static SD_Error                 SD_GetCardInfo(SD_CardInfo *cardinfo);
//000 static SD_Error           SD_GetCardStatus(SD_CardStatus *cardstatus);
static SD_Error                 SD_EnableWideBusOperation(uint32_t WideMode);
static SD_Error                 SD_SelectDeselect(uint64_t addr);
//000 static SD_Error           SD_ReadBlock(uint8_t *readbuff, uint64_t ReadAddr, uint16_t BlockSize);
static SD_Error                 SD_ReadMultiBlocks(uint8_t *readbuff, uint64_t ReadAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
static SD_Error                 SD_WaitReadOperation(void);
//000 static SD_Error           SD_WriteBlock(uint8_t *writebuff, uint64_t WriteAddr, uint16_t BlockSize);
static SD_Error                 SD_WriteMultiBlocks(uint8_t *writebuff, uint64_t WriteAddr, uint16_t BlockSize, uint32_t NumberOfBlocks);
static SD_Error                 SD_WaitWriteOperation(void);
//000 static SDTransferState    SD_GetTransferState(void);
static SD_Error                 SD_StopTransfer(void);
//000 static SD_Error           SD_Erase(uint64_t startaddr, uint64_t endaddr);
static SD_Error                 SD_SendStatus(uint32_t *pcardstatus);
//000 static SD_Error           SD_SendSDStatus(uint32_t *psdstatus);
static SD_Error                 SD_ProcessIRQSrc(void);
static void                     SD_ProcessDMAIRQ(void);
static SD_Error                 CmdError(void);
static SD_Error                 CmdResp7Error(void);
static SD_Error                 CmdResp1Error(uint8_t cmd);
static SD_Error                 CmdResp3Error(void);
static SD_Error                 CmdResp2Error(void);
static SD_Error                 CmdResp6Error(uint8_t cmd, uint16_t *prca);
static SD_Error                 SDEnWideBus(FunctionalState NewState);
//000 static SD_Error           IsCardProgramming(uint8_t *pstatus);
static SD_Error                 FindSCR(uint16_t rca, uint32_t *pscr);
//000 static uint8_t            convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes);
//000 static SD_Error           SD_HighSpeed (void);

//000 static void               SD_LowLevel_DeInit(void);
static void                     SD_LowLevel_Init(void);
static void                     SD_LowLevel_DMA_TxConfig(uint32_t *BufferSRC, uint32_t BufferSize);
static void                     SD_LowLevel_DMA_RxConfig(uint32_t *BufferDST, uint32_t BufferSize);

//--------------------------------------------------------------
// init der Hardware fuer die SDCard-Funktionen
// muss vor der Benutzung einmal gemacht werden
//--------------------------------------------------------------
void
sdcard_init (void)
{
    NVIC_Configuration();
    SD_LowLevel_Init();
}

//--------------------------------------------------------------
// Check ob Medium eingelegt ist
// Return Wert :
//   SD_PRESENT      = wenn Medium eingelegt ist
//   SD_NOT_PRESENT  = wenn kein Medium eingelegt ist
//--------------------------------------------------------------
uint8_t
sdcard_checkmedia (void)
{
    volatile uint8_t status = SD_NOT_PRESENT;

    status=SD_Detect();             // Abfrage ob SD-Karte eingesteckt
    return status;
}

//--------------------------------------------------------------
// MMC_disk_initialize
//--------------------------------------------------------------
int
MMC_disk_initialize(void)
{
    int         rtc;

    if (SD_Init () == SD_OK)
    {
        rtc = 0;
    }
    else
    {
        rtc = -1;
    }

    return rtc;
}

//--------------------------------------------------------------
// MMC_disk_status
//--------------------------------------------------------------
int
MMC_disk_status(void)
{
    int     rtc;

    if (SD_Detect () == SD_PRESENT)
    {
        rtc = 0;
    }
    else
    {
        rtc = -1;
    }

