ukw100/STECCY/src/sdcard/stm32_sdcard.c
    return rtc;
}


//--------------------------------------------------------------
// MMC_disk_read
//--------------------------------------------------------------
int
MMC_disk_read (BYTE *buff, DWORD sector, BYTE UNUSED(count))                                // fm: TODO
{
    SD_Error    status;
    int         rtc;

    SD_ReadMultiBlocks (buff, sector << 9, 512, 1);

    status = SD_WaitReadOperation ();                                                       // check if the Transfer is finished

    while (SD_GetStatus () != SD_TRANSFER_OK)
    {
        ;
    }

    if (status == SD_OK)
    {
        rtc = 0;
    }
    else
    {
        rtc = -1;
    }

    return rtc;
}


//--------------------------------------------------------------
// MMC_disk_write
//--------------------------------------------------------------
int
MMC_disk_write (const BYTE *buff, DWORD sector, BYTE UNUSED(count))                             // fm: TODO
{
    SD_Error    status;
    int         rtc;

    SD_WriteMultiBlocks ((BYTE *)buff, sector << 9, 512, 1);

    status = SD_WaitWriteOperation();                                                           /* Check if the Transfer is finished */

    while (SD_GetStatus () != SD_TRANSFER_OK)
    {
        ;
    }

    if (status == SD_OK)
    {
        rtc = 0;
    }
    else
    {
        rtc = -1;
    }

    return rtc;
}

//--------------------------------------------------------------
// MMC_disk_ioctl
//--------------------------------------------------------------
int
MMC_disk_ioctl (BYTE cmd, void * buff)
{
    int     rtc;

    switch (cmd)
    {
        case GET_SECTOR_COUNT:                                      // Get number of sectors on the disk (DWORD)
            *(DWORD*)buff = 131072;                                 // 4*1024*32 = 131072
            rtc = 0;
            break;
        case GET_SECTOR_SIZE :                                      // Get R/W sector size (WORD)
            *(WORD*)buff = 512;
            rtc = 0;
            break;
        case GET_BLOCK_SIZE :                                       // Get erase block size in unit of sector (DWORD)
            *(DWORD*)buff = 32;
            rtc = 0;
            break;
        case CTRL_SYNC :
            rtc = 0;
            break;
#if 0                                                               // fm: no longer existant, code instead: CTRL_TRIM
        case CTRL_ERASE_SECTOR :
            rtc = 0;
#else
        case CTRL_TRIM :
            rtc = 0;
#endif
            break;
    }

    return rtc;
}

//--------------------------------------------------------------
static void
NVIC_Configuration (void)
{
    NVIC_InitTypeDef NVIC_InitStructure;

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);

    NVIC_InitStructure.NVIC_IRQChannel                      = SDIO_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority           = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd                   = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    NVIC_InitStructure.NVIC_IRQChannel                      = SD_SDIO_DMA_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority    = 1;
    NVIC_Init(&NVIC_InitStructure);
}

#if 000
static void
SD_DeInit(void)
{
    SD_LowLevel_DeInit();
}
#endif

//--------------------------------------------------------------
// SD_Init - init SD card
//--------------------------------------------------------------
static SD_Error
SD_Init(void)
{
    SD_Error errorstatus;

    SDIO_DeInit();
    errorstatus = SD_PowerON ();

    if (errorstatus != SD_OK)
    {
        return errorstatus;                                                     // CMD Response TimeOut (wait for CMDSENT flag)
    }

    errorstatus = SD_InitializeCards ();

    if (errorstatus != SD_OK)
    {
        return (errorstatus);                                                   // CMD Response TimeOut (wait for CMDSENT flag)
    }

    /*!< Configure the SDIO peripheral */
    /*!< SDIO_CK = SDIOCLK / (SDIO_TRANSFER_CLK_DIV + 2) */
    /*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
    SDIO_InitStructure.SDIO_ClockDiv            = SDIO_TRANSFER_CLK_DIV;
    SDIO_InitStructure.SDIO_ClockEdge           = SDIO_ClockEdge_Rising;
    SDIO_InitStructure.SDIO_ClockBypass         = SDIO_ClockBypass_Disable;
    SDIO_InitStructure.SDIO_ClockPowerSave      = SDIO_ClockPowerSave_Disable;
    SDIO_InitStructure.SDIO_BusWide             = SDIO_BusWide_1b;
    SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
    SDIO_Init(&SDIO_InitStructure);

    errorstatus = SD_GetCardInfo(&SDCardInfo);

    if (errorstatus == SD_OK)
    {
        errorstatus = SD_SelectDeselect((uint32_t) (SDCardInfo.RCA << 16));
    }

    if (errorstatus == SD_OK)
    {
#if USE_SDIO_4BIT_MODE==1
        errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_4b);
#else
        errorstatus = SD_EnableWideBusOperation (SDIO_BusWide_1b);
#endif
    }

    return errorstatus;
}

static SDTransferState
SD_GetStatus(void)
{
    SDCardState cardstate =  SD_CARD_TRANSFER;

    cardstate = SD_GetState();

    if (cardstate == SD_CARD_TRANSFER)
    {
        return SD_TRANSFER_OK;
    }
    else if(cardstate == SD_CARD_ERROR)
    {
        return SD_TRANSFER_ERROR;
    }

    return SD_TRANSFER_BUSY;
}

SDCardState
SD_GetState(void)
{
    uint32_t resp1 = 0;

    if(SD_Detect()== SD_PRESENT)
    {
        if (SD_SendStatus(&resp1) != SD_OK)
        {
            return SD_CARD_ERROR;
        }
        else
        {
            return (SDCardState)((resp1 >> 9) & 0x0F);
        }
    }
    else
    {
        return SD_CARD_ERROR;
    }
}

static uint8_t
SD_Detect(void)
{
    uint8_t status = SD_PRESENT;

#if USE_DETECT_PIN==1
    /*!< Check GPIO to detect SD */
    if (GPIO_ReadInputDataBit(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) != Bit_RESET)
    {
        status = SD_NOT_PRESENT;
    }
#endif

