ukw100/STECCY/src/sdcard/stm32_sdcard.c
      if (errorstatus != SD_OK)
      {
        return errorstatus;
      }

      /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
      SDIO_CmdInitStructure.SDIO_Argument = 0x2;
      SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_SD_SET_BUSWIDTH;
      SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
      SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
      SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
      SDIO_SendCommand(&SDIO_CmdInitStructure);

      errorstatus = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);

      if (errorstatus != SD_OK)
      {
        return errorstatus;
      }
      return errorstatus;
    }
    else
    {
      errorstatus = SD_REQUEST_NOT_APPLICABLE;
      return errorstatus;
    }
  }   /*!< If wide bus operation to be disabled */
  else
  {
    /*!< If requested card supports 1 bit mode operation */
    if ((scr[1] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO)
    {
      /*!< Send CMD55 APP_CMD with argument as card's RCA.*/
      SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
      SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
      SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
      SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
      SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
      SDIO_SendCommand(&SDIO_CmdInitStructure);


      errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

      if (errorstatus != SD_OK)
      {
        return errorstatus;
      }

      /*!< Send ACMD6 APP_CMD with argument as 2 for wide bus mode */
      SDIO_CmdInitStructure.SDIO_Argument = 0x00;
      SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_SD_SET_BUSWIDTH;
      SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
      SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
      SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
      SDIO_SendCommand(&SDIO_CmdInitStructure);

      errorstatus = CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);

      if (errorstatus != SD_OK)
      {
        return errorstatus;
      }

      return errorstatus;
    }
    else
    {
      errorstatus = SD_REQUEST_NOT_APPLICABLE;
      return errorstatus;
    }
  }
}

//--------------------------------------------------------------
#if 000
static SD_Error
IsCardProgramming(uint8_t *pstatus)
{
  SD_Error errorstatus = SD_OK;
  volatile uint32_t respR1 = 0, status = 0;

  SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SEND_STATUS;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  status = SDIO->STA;
  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
  {
    status = SDIO->STA;
  }

  if (status & SDIO_FLAG_CTIMEOUT)
  {
    errorstatus = SD_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
        return errorstatus;
  }
  else if (status & SDIO_FLAG_CCRCFAIL)
  {
    errorstatus = SD_CMD_CRC_FAIL;
    SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
        return errorstatus;
  }

  status = (uint32_t)SDIO_GetCommandResponse();

  /*!< Check response received is of desired command */
  if (status != SD_CMD_SEND_STATUS)
  {
    errorstatus = SD_ILLEGAL_CMD;
        return errorstatus;
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);


  /*!< We have received response, retrieve it for analysis  */
  respR1 = SDIO_GetResponse(SDIO_RESP1);

  /*!< Find out card status */
  *pstatus = (uint8_t) ((respR1 >> 9) & 0x0000000F);

  if ((respR1 & SD_OCR_ERRORBITS) == SD_ALLZERO)
  {
        return errorstatus;
  }

  if (respR1 & SD_OCR_ADDR_OUT_OF_RANGE)
  {
    return SD_ADDR_OUT_OF_RANGE;
  }

  if (respR1 & SD_OCR_ADDR_MISALIGNED)
  {
    return SD_ADDR_MISALIGNED;
  }

  if (respR1 & SD_OCR_BLOCK_LEN_ERR)
  {
    return SD_BLOCK_LEN_ERR;
  }

  if (respR1 & SD_OCR_ERASE_SEQ_ERR)
  {
    return SD_ERASE_SEQ_ERR;
  }

  if (respR1 & SD_OCR_BAD_ERASE_PARAM)
  {
    return SD_BAD_ERASE_PARAM;
  }

  if (respR1 & SD_OCR_WRITE_PROT_VIOLATION)
  {
    return SD_WRITE_PROT_VIOLATION;
  }

  if (respR1 & SD_OCR_LOCK_UNLOCK_FAILED)
  {
    return SD_LOCK_UNLOCK_FAILED;
  }

  if (respR1 & SD_OCR_COM_CRC_FAILED)
  {
    return SD_COM_CRC_FAILED;
  }

  if (respR1 & SD_OCR_ILLEGAL_CMD)
  {
    return SD_ILLEGAL_CMD;
  }

  if (respR1 & SD_OCR_CARD_ECC_FAILED)
  {
    return SD_CARD_ECC_FAILED;
  }

  if (respR1 & SD_OCR_CC_ERROR)
  {
    return SD_CC_ERROR;
  }

  if (respR1 & SD_OCR_GENERAL_UNKNOWN_ERROR)
  {
    return SD_GENERAL_UNKNOWN_ERROR;
  }

  if (respR1 & SD_OCR_STREAM_READ_UNDERRUN)
  {
    return SD_STREAM_READ_UNDERRUN;
  }

  if (respR1 & SD_OCR_STREAM_WRITE_OVERRUN)
  {
    return SD_STREAM_WRITE_OVERRUN;
  }

  if (respR1 & SD_OCR_CID_CSD_OVERWRIETE)
  {
    return SD_CID_CSD_OVERWRITE;
  }

  if (respR1 & SD_OCR_WP_ERASE_SKIP)
  {
    return SD_WP_ERASE_SKIP;
  }

  if (respR1 & SD_OCR_CARD_ECC_DISABLED)
  {
    return SD_CARD_ECC_DISABLED;
  }

  if (respR1 & SD_OCR_ERASE_RESET)
  {
    return SD_ERASE_RESET;
  }

  if (respR1 & SD_OCR_AKE_SEQ_ERROR)
  {
    return SD_AKE_SEQ_ERROR;
  }

    return errorstatus;
}
#endif //000

//--------------------------------------------------------------
static SD_Error
FindSCR (uint16_t UNUSED(rca), uint32_t *pscr)                               // fm: TODO?
{
  uint32_t index = 0;
  SD_Error errorstatus = SD_OK;
  uint32_t tempscr[2] = {0, 0};

  /*!< Set Block Size To 8 Bytes */
  /*!< Send CMD55 APP_CMD with argument as card's RCA */
  SDIO_CmdInitStructure.SDIO_Argument = (uint32_t)8;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

